In [1]:
import pandas as pd
import os
import numpy as np

In [2]:
os.listdir()

['.ipynb_checkpoints',
 'income.csv',
 'Introduction with pandas .ipynb',
 'Iris_data_sample.xlsx',
 'Toyota.csv',
 'Untitled.ipynb']

In [3]:
df_cars=pd.read_csv("Toyota.csv", index_col=0)

In [4]:
df_cars1 = df_cars.copy(deep=True)

# Including data types

In [5]:
df_cars1.dtypes #check data types

Price          int64
Age          float64
KM            object
FuelType      object
HP            object
MetColor     float64
Automatic      int64
CC             int64
Doors         object
Weight         int64
dtype: object

In [12]:
#Select data based on data types
df_cars1.select_dtypes(include=[], exclude=[object])

      Price   Age  MetColor  Automatic    CC  Weight
0     13500  23.0       1.0          0  2000    1165
1     13750  23.0       1.0          0  2000    1165
2     13950  24.0       NaN          0  2000    1165
3     14950  26.0       0.0          0  2000    1165
4     13750  30.0       0.0          0  2000    1170
...     ...   ...       ...        ...   ...     ...
1431   7500   NaN       1.0          0  1300    1025
1432  10845  72.0       0.0          0  1300    1015
1433   8500   NaN       0.0          0  1300    1015
1434   7250  70.0       1.0          0  1300    1015
1435   6950  76.0       0.0          0  1600    1114

[1436 rows x 6 columns]

In [14]:
#Concise Summary of Dataframe
df_cars1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB

In [16]:
# get unique Elements of Column
print(np.unique(df_cars1['KM']))

['1' '10000' '100123' ... '99865' '99971' '??']

In [17]:
print(np.unique(df_cars1['HP']))

['107' '110' '116' '192' '69' '71' '72' '73' '86' '90' '97' '98' '????']

In [18]:
print(np.unique(df_cars1['MetColor']))

[ 0.  1. nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan nan
 nan nan nan nan nan nan nan nan]

In [19]:
print(np.unique(df_cars1['Automatic']))

[0 1]

In [20]:
print(np.unique(df_cars1['Doors']))

['2' '3' '4' '5' 'five' 'four' 'three']

In [21]:
#create a new dataframe from df_cars1
cars2 = pd.read_csv("Toyota.csv", index_col=0, na_values=["??", "???"])

In [22]:
print(np.unique(cars2["KM"]))

[  1.  15. 225. ...  nan  nan  nan]

In [23]:
print(np.unique(cars2["HP"]))

['107' '110' '116' '192' '69' '71' '72' '73' '86' '90' '97' '98' '????']

In [25]:
df_cars1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1436 non-null   object
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB

In [24]:
cars2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   float64
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(3), int64(4), object(3)
memory usage: 123.4+ KB

In [26]:
#Convert variableâ€™s data types
cars2["MetColor"] = cars2["MetColor"].astype("object")

In [27]:
cars2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   int64
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   object
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB

In [29]:
cars2['Automatic'] = cars2['Automatic'].astype('object')

In [30]:
#Clean column â€˜Doorsâ€™ using replace function
cars2["Doors"].replace("three",3, inplace = True)

In [31]:
cars2["Doors"].replace("four",4, inplace = True)

In [32]:
cars2["Doors"].replace("five",5, inplace = True)

In [33]:
cars2['Doors'] = cars2['Doors'].astype('int64')

In [34]:
cars2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Price      1436 non-null   int64
 1   Age        1336 non-null   float64
 2   KM         1421 non-null   float64
 3   FuelType   1336 non-null   object
 4   HP         1436 non-null   object
 5   MetColor   1286 non-null   object
 6   Automatic  1436 non-null   object
 7   CC         1436 non-null   int64
 8   Doors      1436 non-null   int64
 9   Weight     1436 non-null   int64
dtypes: float64(2), int64(4), object(4)
memory usage: 123.4+ KB

# Export data into files

In [35]:
cars2.to_csv("filtered.csv", index=False)

In [36]:
print(np.unique(cars2['Doors']))

[2 3 4 5]

In [37]:
# detect missing values (isnull() and sum it)
cars2.isnull().sum()

Price          0
Age          100
KM            15
FuelType     100
HP             0
MetColor     150
Automatic      0
CC             0
Doors          0
Weight         0
dtype: int64

In [38]:
# Insert a new column in the dataframe cars2
cars2.insert(10,"Price_class", "")

In [39]:
cars2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1436 entries, 0 to 1435
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Price        1436 non-null   int64
 1   Age          1336 non-null   float64
 2   KM           1421 non-null   float64
 3   FuelType     1336 non-null   object
 4   HP           1436 non-null   object
 5   MetColor     1286 non-null   object
 6   Automatic    1436 non-null   object
 7   CC           1436 non-null   int64
 8   Doors        1436 non-null   int64
 9   Weight       1436 non-null   int64
 10  Price_class  1436 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 134.6+ KB

In [42]:
#use for loop to categorize cars prices and save in the new column
for i in range(0,len(cars2["Price"]),1):
    if(cars2["Price"][i]<=8450):
        cars2["Price_class"][i] = "Low"
    elif(cars2["Price"][i]>11950):
        cars2["Price_class"][i] = "High"
    else:
        cars2["Price_class"][i]="Medium"

C:\Users\lenovo\AppData\Local\Temp/ipykernel_36008/178357096.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars2["Price_class"][i] = "High"
C:\Users\lenovo\AppData\Local\Temp/ipykernel_36008/178357096.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars2["Price_class"][i] = "Low"
C:\Users\lenovo\AppData\Local\Temp/ipykernel_36008/178357096.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cars2["Price_class"][i]="Medium"

In [43]:
print(cars2["Price_class"])

0         High
1         High
2         High
3         High
4         High
         ...
1431       Low
1432    Medium
1433    Medium
1434       Low
1435       Low
Name: Price_class, Length: 1436, dtype: object

In [44]:
# Count the unique values in the Price_class column
cars2["Price_class"].value_counts()

Medium    751
Low       369
High      316
Name: Price_class, dtype: int64

# Use functions

In [ ]:
cars2.insert(11,"Age_converted",0)

In [50]:
# write a function to convert cars age from Months to years
def c_convert(val):
    val_converted = val/12
    return val_converted

In [51]:
cars2["age_converted"]=c_convert(cars2["Age"])

In [ ]:
cars2["age_converted"]=round(c_convert(cars2["Age"]),1)

# Convert cars age from months to years and to find km per month run by car

In [62]:
# we can use multi input and multi output with functions
#to make changes in data 
def c_convert(val1,val2):
    val_converted = val1 / 12
    ratio = val2 /val1
    return [val_converted, ratio]

In [72]:
cars2["age_converted"],cars2["KM_per_month"] = c_convert(cars2['Age'], cars2['KM'])

In [68]:
cars2.head()

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_class,Age_converted,KM_per_month,age_converted,km_per_month
0,13500,23.0,46986.0,Diesel,90,1.0,0,2000,3,1165,High,0,2042.869565,1.916667,2042.869565
1,13750,23.0,72937.0,Diesel,90,1.0,0,2000,3,1165,High,0,3171.173913,1.916667,3171.173913
2,13950,24.0,41711.0,Diesel,90,NaN,0,2000,3,1165,High,0,1737.958333,2.000000,1737.958333
3,14950,26.0,48000.0,Diesel,90,0.0,0,2000,3,1165,High,0,1846.153846,2.166667,1846.153846
4,13750,30.0,38500.0,Diesel,90,0.0,0,2000,3,1170,High,0,1283.333333,2.500000,1283.333333

In [73]:
# need to drop the column Age converted because we have age_converted 
cars2 = cars2.drop(columns=["Age_converted"])

In [75]:
# now sort values in dataframe
cars2.sort_values(["FuelType","HP"], ascending = [1,0])

,Price,Age,KM,FuelType,HP,MetColor,Automatic,CC,Doors,Weight,Price_class,KM_per_month,age_converted,km_per_month
189,7750,43.0,178858.0,CNG,110,0.0,0,1600,3,1084,Low,4159.488372,3.583333,4159.488372
199,11950,NaN,98823.0,CNG,110,1.0,0,1600,5,1119,Medium,NaN,NaN,NaN
209,11950,37.0,82743.0,CNG,110,1.0,0,1600,5,1121,Medium,2236.297297,3.083333,2236.297297
223,14950,44.0,71793.0,CNG,110,NaN,0,1600,4,1067,High,1631.659091,3.666667,1631.659091
296,12950,44.0,41499.0,CNG,110,1.0,0,1600,5,1103,High,943.159091,3.666667,943.159091
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1336,8500,79.0,63918.0,NaN,110,NaN,0,1600,4,1035,Medium,809.088608,6.583333,809.088608
1393,7250,69.0,49640.0,NaN,110,1.0,0,1600,4,1035,Low,719.420290,5.750000,719.420290
1394,7450,80.0,49580.0,NaN,110,1.0,0,1600,4,1035,Low,619.750000,6.666667,619.750000
1420,8150,76.0,36537.0,NaN,110,0.0,1,1600,4,1075,Low,480.750000,6.333333,480.750000
1422,7600,NaN,36000.0,NaN,110,1.0,0,1600,3,1050,Low,NaN,NaN,NaN

In [76]:
#describe the dataframe
cars2.describe()

,Price,Age,KM,CC,Doors,Weight,KM_per_month,age_converted,km_per_month
count,1436.000000,1336.000000,1421.000000,1436.000000,1436.000000,1436.00000,1321.000000,1336.000000,1321.000000
mean,10730.824513,55.672156,68647.239972,1566.827994,4.033426,1072.45961,1260.217457,4.639346,1260.217457
std,3626.964585,18.589804,37333.023589,187.182436,0.952677,52.64112,638.188748,1.549150,638.188748
min,4350.000000,1.000000,1.000000,1300.000000,2.000000,1000.00000,0.013158,0.083333,0.013158
25%,8450.000000,43.000000,43210.000000,1400.000000,3.000000,1040.00000,865.000000,3.583333,865.000000
50%,9900.000000,60.000000,63634.000000,1600.000000,4.000000,1070.00000,1135.762712,5.000000,1135.762712
75%,11950.000000,70.000000,87000.000000,1600.000000,5.000000,1085.00000,1513.965517,5.833333,1513.965517
max,32500.000000,80.000000,243000.000000,2000.000000,5.000000,1615.00000,5651.162791,6.666667,5651.162791

In [77]:
cars2 = cars2.to_csv("modified.txt", sep="\t", index=False)

In [79]:
os.listdir()

['.ipynb_checkpoints',
 'Cars Data Analysis.ipynb',
 'filtered.csv',
 'income.csv',
 'Introduction with pandas .ipynb',
 'Iris_data_sample.xlsx',
 'modified.txt',
 'Toyota.csv']

In [80]:
# make filtered groups
cars3 = pd.read_csv('filtered.csv')

cars3['count'] = 1

cars3.groupby(['FuelType', 'HP']).count()['count']

FuelType  HP
CNG       110      15
Diesel    110       2
          116       7
          69       31
          72       69
          73        1
          90       31
          ????      3
Petrol    107      21
          110     760
          116       1
          192      10
          71        1
          86      226
          97      154
          98        2
          ????      2
Name: count, dtype: int64

# Explatory Analysis

In [81]:
# Check the relationship between two categorical variables with cross tabulation
pd.crosstab(index=cars3['FuelType'], columns='count', dropna=True)

col_0     count
FuelType
CNG          15
Diesel      144
Petrol     1177

In [82]:
pd.crosstab(index = cars3['Automatic'], 
            columns=cars3['FuelType'],
            dropna=True)

FuelType   CNG  Diesel  Petrol
Automatic
0           15     144    1104
1            0       0      73

In [83]:
pd.crosstab(index = cars3['Automatic'], 
            columns=cars3['FuelType'],
            normalize=True,
            dropna=True)

FuelType        CNG    Diesel    Petrol
Automatic
0          0.011228  0.107784  0.826347
1          0.000000  0.000000  0.054641

In [84]:
pd.crosstab(index = cars3['Automatic'], 
            columns=cars3['FuelType'],
            margins=True,
            normalize=True,
            dropna=True)

FuelType        CNG    Diesel    Petrol       All
Automatic
0          0.011228  0.107784  0.826347  0.945359
1          0.000000  0.000000  0.054641  0.054641
All        0.011228  0.107784  0.880988  1.000000